In [36]:
import pandas as pd
import numpy as np

In [5]:
apples = pd.Series([3,4,6,2])
oranges = pd.Series([1,4,2,3])

In [7]:
data = {"apples": apples, "oranges": oranges}
fruit_df = pd.DataFrame(data)
print(fruit_df)

   apples  oranges
0       3        1
1       4        4
2       6        2
3       2        3

In [12]:
apples = pd.Series([3,4,6,2], ["a", "b", "c", "d"])
oranges = pd.Series([1,4,2,3], ["mon", "tue", "wed", "thr"])
data = {"apples": apples, "oranges": oranges}
fruit_df = pd.DataFrame(data)
print(fruit_df)

     apples  oranges
a       3.0      NaN
b       4.0      NaN
c       6.0      NaN
d       2.0      NaN
mon     NaN      1.0
thr     NaN      3.0
tue     NaN      4.0
wed     NaN      2.0

In [14]:
state = ["ohio", "ohio", "ohio", "nevada", "nevada", "nevada"]
data = {"state": state, 
        "year" : [2000, 2001, 2002, 2001, 2002, 20003],
        "pop"  : [1.5,1.7,3.6,2.4,2.9,3.2]}
state_pop_df = pd.DataFrame(data, index = ['1st', '2nd', '3rd', '4th', '5th', '6th'])
print(state_pop_df)

      state   year  pop
1st    ohio   2000  1.5
2nd    ohio   2001  1.7
3rd    ohio   2002  3.6
4th  nevada   2001  2.4
5th  nevada   2002  2.9
6th  nevada  20003  3.2

In [20]:
state_pop_df = pd.DataFrame(data, columns=['year', 'state', 'pop'])
state_pop_df.head()

   year   state  pop
0  2000    ohio  1.5
1  2001    ohio  1.7
2  2002    ohio  3.6
3  2001  nevada  2.4
4  2002  nevada  2.9

In [21]:
from pandas import DataFrame

In [18]:
a = DataFrame(data)

In [19]:
print(a)

    state   year  pop
0    ohio   2000  1.5
1    ohio   2001  1.7
2    ohio   2002  3.6
3  nevada   2001  2.4
4  nevada   2002  2.9
5  nevada  20003  3.2

In [31]:
frame2 = DataFrame(data, columns=["year", "state", "pop", "debt"], 
                  index=[10, 20, 30, 40, 50, 60])
frame2.head()

    year   state  pop debt
10  2000    ohio  1.5  NaN
20  2001    ohio  1.7  NaN
30  2002    ohio  3.6  NaN
40  2001  nevada  2.4  NaN
50  2002  nevada  2.9  NaN

In [23]:
print(frame2.columns)
print(frame2.index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [24]:
frame2["state"]

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [25]:
frame2.state

one        ohio
two        ohio
three      ohio
four     nevada
five     nevada
six      nevada
Name: state, dtype: object

In [27]:
print(frame2.loc['two'])

year     2001
state    ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [28]:
state_pop_df.head()
frame2.head()

       year   state  pop debt
one    2000    ohio  1.5  NaN
two    2001    ohio  1.7  NaN
three  2002    ohio  3.6  NaN
four   2001  nevada  2.4  NaN
five   2002  nevada  2.9  NaN

In [35]:
#loc = column 
frame2.iloc[4]

year       2002
state    nevada
pop         2.9
debt        NaN
Name: 50, dtype: object

In [37]:
ln = len(frame2)
print(ln)
rng = np.arange(ln)
print(rng)
frame2['debt'] = rng
frame2

6
[0 1 2 3 4 5]

     year   state  pop  debt
10   2000    ohio  1.5     0
20   2001    ohio  1.7     1
30   2002    ohio  3.6     2
40   2001  nevada  2.4     3
50   2002  nevada  2.9     4
60  20003  nevada  3.2     5